{
    "portfolio": [
        {
            "category": "App",
            "id": 1,
            "title": "Flight Booking App",
            "subtitle": "The journey begins",
            "type": "Case Study",
            "img": "/project/flightapp/flight-app-hero.gif",
            "main": "/project/flightapp/flight-app-hero.gif",
            "desc": "As a frequent traveler, I have always seen flight booking app as a gateway to new adventures. However, during my exploration of the app, I noticed opportunities to enhance the user experience. My goal was to create a more seamless and enjoyable journey for users looking to book their next trip.",
            "skill": "UX/UI",
            "isFeatured": false,
            "isLatest": true,
            "month": "06",
            "year": "2024",
            "tag": "Book",
            "demo": "https://www.figma.com/proto/mXRDv1Scb8THEIzC9XNZbj/AVZ_ProjectRyanair_app?page-id=3102%3A60&type=design&node-id=3163-2472&viewport=607%2C382%2C0.18&t=bbRK2fOt9HVWTbxQ-1&scaling=scale-down&starting-point-node-id=3163%3A2472&content-scaling=fixed",
            "overview": "Overview content goes here...",
            "dropdowns": [
                {
                    "title": "Uncovering the users",
                    "image": "/project/flightapp/flight-app-main.png",
                    "text": "A UX audit and analysis of app store feedback revealed key trends among users. While many appreciated features like real-time notifications and personalized recommendations, there was a clear desire for a more streamlined experience. Users found navigation challenging and sought inspiration for exploring new destinations, especially through curated content showcasing unique travel experiences. These insights informed my design, resulting in an intuitive interface that simplifies navigation and enhances discovery."
                },
                {
                    "title": "Research Findings",
                    "image": "/project/flightapp/flight-app-persona.png",
                    "text": "User stories were created from detailed user personas to capture the diverse motivations and preferences of our audience. For example, a frequent traveler emphasized the need for intuitive discovery and personalized recommendations, while another persona highlighted the importance of seamless social sharing. These insights directly guided design decisions, ensuring the final product meets specific user needs and fosters a more engaging experience."
                },
                {
                    "title": "Design Process",
                    "image": "/project/flightapp/flight-app-process.png",
                    "text": "After the research phase, an iterative design process was employed using Figma to create app prototypes. This method facilitated continuous refinement by incorporating user feedback at each stage. Starting with low-fidelity wireframes allowed for quick exploration of layout options and functionality, making early user testing efficient."
                },
                {
                    "title": "Key Feature",
                    "image": "/project/flightapp/flight-app-flow.png",
                    "text": "The design includes a cleaner interface that emphasizes essential elements, improving overall navigation. A dedicated section for flexible travel options enables users to easily explore various routes. Additionally, engaging content highlights popular destinations and offers travel tips, inspiring users to broaden their travel horizons."
                }
            ],
            "text": "Highlighting the streamlined user flow designed to enhance the travel experience, the interface prioritizes intuitive navigation, guiding users effortlessly through the search and booking processes.",
            "flow": "/project/flightapp/flight-app-feature.png",
            "conclusion": "Throughout the process, the importance of actively listening to user needs and adapting the design based on feedback became clear. The iterative approach highlighted the value of flexibility in travel options and demonstrated how engaging content can inspire users to explore new horizons. These insights emphasize the significance of user-centered design, transforming travel planning into an enjoyable and enriching experience.",
            "shot": "/project/flightapp/flight-app-shot.png"
        },
        {
            "category": "App",
            "id": 2,
            "title": "Keywi Music App",
            "subtitle": "Tune into your Taste ",
            "type": "Case Study",
            "img": "/project/keywi/keywi-img.png",
            "main": "/project/keywi/keywi-main.png",
            "desc": "As a dedicated music enthusiast, I view music recommendation apps as gateways to discovering new artists and genres. While exploring various apps, I recognized exciting opportunities to elevate the user experience. My goal was to design an engaging platform that seamlessly connects users with music that resonates with their tastes, transforming the discovery process into an enjoyable adventure.",
            "skill": "UX/UI",
            "isFeatured": true,
            "isLatest": false,
            "month": "06",
            "year": "2024",
            "tag": "Listen",
            "demo": "https://www.figma.com/proto/mXRDv1Scb8THEIzC9XNZbj/AVZ_ProjectRyanair_app?page-id=3102%3A60&type=design&node-id=3163-2472&viewport=607%2C382%2C0.18&t=bbRK2fOt9HVWTbxQ-1&scaling=scale-down&starting-point-node-id=3163%3A2472&content-scaling=fixed",
            "overview": "Introducing a groundbreaking music recommendation app designed to revolutionize how users discover new songs and connect with their musical identity. With an intuitive swiping interface, users can pre-listen to tracks and find similar music tastes, transforming the music exploration journey into an engaging experience.",
            "dropdowns": [
                {
                    "title": "Uncovering the Users",
                    "image": "/project/keywi/keywi-main.png",
                    "text": "Through a comprehensive UX audit and analysis of app store feedback, we uncovered fascinating insights into user behavior. Many users expressed excitement about features like song previews and personalized playlists, yet they craved a more seamless browsing experience. Users reported spending a significant amount of time searching for new artists and genres, highlighting their desire for curated recommendations that feel tailored to their unique tastes. This research was instrumental in shaping the app's intuitive interface, which simplifies navigation and enhances the discovery process."
                },
                {
                    "title": "Research Findings",
                    "image": "/project/keywi/keywi-persona.png",
                    "text": "Crafting user stories from detailed personas unveiled the diverse motivations that drive our audience. For example, the 'Casual Listener' values quick access to song previews and the thrill of swiping through new tracks, while the 'Music Aficionado' seeks deep dives into unique artists and the joy of sharing curated playlists. This nuanced understanding of user behavior guided our design decisions, ensuring the final product resonates with specific user needs and creates a dynamic, engaging experience."
                },
                {
                    "title": "Design Process",
                    "image": "/project/flightapp/flight-app-process.png",
                    "text": "In this self-initiated project, I embraced an iterative design process using Figma to develop prototypes that truly reflect user desires. This method allowed for continuous refinement based on real user feedback at every stage. Starting with low-fidelity wireframes, I rapidly explored various layout options and functionalities, enabling early user testing that informed crucial design choices and enriched the final product."
                },
                {
                    "title": "Key Feature",
                    "image": "/project/keywi/keywi-flow.png",
                    "text": "The redesigned app showcases a vibrant, user-friendly interface that highlights essential features, making music discovery a breeze. A dedicated section for swiping through tracks empowers users to easily find new music that aligns with their tastes. Additionally, engaging content promotes popular tracks and artists, igniting users’ curiosity to explore and expand their musical horizons."
                }
            ],
            "text": "The app’s interface prioritizes intuitive navigation, with a particular focus on the registration and onboarding process, guiding users effortlessly through song previews and engaging swiping actions",
            "flow": "/project/keywi/keywi-feature.png",
            "conclusion": "This self-initiated project underscored the importance of actively listening to user needs and adapting the design based on real-world feedback. The iterative approach not only highlighted the critical role of personalized recommendations but also revealed how compelling content can inspire users to explore new music. These insights reinforce the significance of user-centered design, transforming music discovery into an exciting and enriching journey.",
            "shot": "//project/keywi/keywi-shot.png"
        },
        {
            "category": "Branding",
            "id": 3,
            "title": "mokebo Rebrand",
            "subtitle": "Timeless icons",
            "type": "Brand Book",
            "img": "/placeholder1.png",
            "desc": "Mokebo is an innovative e-commerce platform dedicated to providing sustainable furniture solutions. This rebranding project aimed to enhance Mokebo’s online presence, reflecting its commitment to environmentally friendly practices and stylish, functional design.",
            "skill": "Digital Experience",
            "isFeatured": false,
            "month": "06",
            "year": "2024",
            "tag": "icons",
            "pdfUrl": "/files/mokebobrand.pdf",
            "text": "These icons serve as a visual representation of the brand's commitment to quality and eco-friendly practices. By prioritizing simplicity and elegance, the icons enhance the overall aesthetic of Mokebo's offerings, providing a cohesive identity that resonates with customers. This thoughtful design approach not only elevates the brand's image but also reinforces its dedication to sustainability in the furniture industry.",
            "flow": "/project/mokebo-feature.png",
            "conclusion": "This project emphasized capturing the essence of Vietnamese cuisine and transforming it into a modern yet authentic brand identity. By blending traditional elements with contemporary design, the branding highlights the rich culinary heritage while appealing to a diverse audience. The iterative process showcased the value of refining design choices based on visual feedback, leading to a vibrant and inviting brand that celebrates authenticity, freshness, and the unique flavors of Vietnamese street food.",
            "shot": "/project/kmadam-do-shot.png"
        },
        {
            "category": "Branding",
            "id": 5,
            "title": "Madam Do",
            "subtitle": "Bahn Mi to go",
            "type": "Branding",
            "img": "/project/madamdo/madamdo-img.png",
            "desc": "focused on bringing authentic Vietnamese street food to Germany. The branding combines traditional Vietnamese aesthetics with modern design elements to appeal to a diverse audience.",
            "skill": "Branding",
            "isFeatured": true,
            "month": "02",
            "year": "2021",
            "tag": "Brand Book",
            "pdfUrl": "/files/madamdobrand.pdf",
            "text": "The branding draws inspiration from fresh Vietnamese ingredients, capturing the vibrant colors and textures that define the cuisine. A carefully selected color palette emphasizes freshness, while the Saigon font is used to highlight the brand's authentic origins, evoking the rich culture and flavors of Vietnam.",
            "flow": "/project/madamdo/madamdo-feature.png",
            "conclusion": "This project emphasized capturing the essence of Vietnamese cuisine and transforming it into a modern yet authentic brand identity. By blending traditional elements with contemporary design, the branding highlights the rich culinary heritage while appealing to a diverse audience. The iterative process showcased the value of refining design choices based on visual feedback, leading to a vibrant and inviting brand that celebrates authenticity, freshness, and the unique flavors of Vietnamese street food.",
            "shot": "/project/madamdo/kmadam-do-shot.png"
        },
        {
            "category": "Branding",
            "id": 6,
            "title": "Philip Kehela",
            "subtitle": "E-commerce Consultant",
            "type": "Branding",
            "img": "/content-1.png",
            "desc": "Philip Kehela is a digital commerce consultant who wanted to strengthen his online presence with a cohesive and modern personal brand. The project focused on creating a digital identity that conveys his expertise in the field of e-commerce, while ensuring a sleek and functional design for his website.",
            "skill": "Branding",
            "isFeatured": true,
            "month": "06",
            "year": "2024",
            "tag": "Consult",
            "pdfUrl": "/files/pkebrand.pdf",
            "text": " This project involved building a strong personal brand for Philip Kehela, a digital commerce consultant, by designing and launching a refreshed digital presence. We developed a new website using Elementor, which brought his ideas to life through clean and intuitive design. Careful attention was given to selecting logos, fonts, and layout to ensure they communicated his approach to digital commerce effectively. The relaunch resulted in a visually appealing, user-friendly site that supports Philip's work in the industry.",
            "flow": "/project/pke-feature.png",
            "conclusion": "In conclusion, this project successfully established a modern digital identity for Philip Kehela, enhancing his online presence as a digital commerce consultant. By designing a sleek, user-friendly website with Elementor, we translated his expertise into a visually appealing platform. The careful selection of logos, fonts, and layout effectively communicated his approach to digital commerce. This revitalized presence positions Philip for continued growth and engagement within the e-commerce landscape.",
            "shot": "/project/pke-shot.png"
        }
    ]
}