{
    "portfolio": [
        {
            "category": "App",
            "id": 1,
            "title": "Flight Booking App",
            "subtitle": "Along the Journey",
            "type": "Case Study",
            "img": "/project/flightapp/flight-app-hero.gif",
            "main": "/project/flightapp/flight-app-hero.gif",
            "desc": "In an age where travel is as spontaneous as it is planned, booking a flight should feel seamless—yet for many users, it doesn’t. This self-initiated project was born from a simple question: 'Why does booking a flight on mobile still feel so clunky?' I set out to explore and redesign the flight booking experience through the lens of user-centered design, creating a concept app that simplifies the process while delivering clarity, trust, and delight throughout the journey.",
            "skill": "UX/UI",
            "isFeatured": false,
            "isLatest": true,
            "month": "06",
            "year": "2024",
            "tag": "Book",
            "demo": "https://www.figma.com/proto/mXRDv1Scb8THEIzC9XNZbj/AVZ_ProjectRyanair_app?page-id=3102%3A60&type=design&node-id=3163-2472&viewport=607%2C382%2C0.18&t=bbRK2fOt9HVWTbxQ-1&scaling=scale-down&starting-point-node-id=3163%3A2472&content-scaling=fixed",
            "overview": "Overview content goes here...",
            "dropdowns": [
                {
                    "title": "Voices from the Sky",
                    "image": "/project/flightapp/flight-app-main.png",
                    "text": "Before diving into design, I turned to where travelers express their frustrations the most: app store reviews. By analyzing over 100 reviews from major flight booking apps, recurring frustrations surfaced. Users felt overwhelmed, filters were too rigid, and personalization was lacking. A key takeaway: many felt the app didn’t ‘get’ them, which led to decision fatigue. This insight led to the question: What if the search experience *learned* from you, adapting over time and surfacing relevant options as you go?"
                },
                {
                    "title": "Personas on the Move",
                    "image": "/project/flightapp/flight-app-persona.png",
                    "text": "Rather than designing for abstract personas, I focused on the *real behaviors* of travelers. Three main user profiles emerged from the research: the **Spontaneous Explorer**, the **Price Tracker**, and the **Planner**. These personas represent different motivations when booking a flight—ranging from urgent, last-minute plans to highly detailed, price-conscious decision-making. Designing for these unique behaviors helped shape the app’s flexibility, ensuring it could meet the needs of diverse travelers."
                },
                {
                    "title": "A Modular System for a Streamlined Experience",
                    "image": "/project/flightapp/flight-app-design.png",
                    "text": "The design process was iterative. After gathering insights from users, I began with low-fidelity wireframes in Figma, testing ideas quickly and refining based on feedback. The main goal was to make the filter system **adaptive**: no more static, buried settings. Filters should be dynamic, intuitive, and visible when needed. This modular system ensures that users can narrow down flights without feeling bogged down by options."
                },
                {
                    "title": "Features That Take Off",
                    "image": "/project/flightapp/flight-app-shots.png",
                    "text": "Key features include smarter, adaptive search results that prioritize relevant options based on the user’s preferences and behaviors. Filters appear dynamically—no need to dig through menus. The result: faster, more personalized flight options. I also included a flexible travel section that allows users to toggle through various routes or times based on their preferences. The aim was to make booking feel more like a seamless journey than a tedious task."
                }
            ],
            "text": "At the heart of this design is a seamless search experience—one that adapts based on how you interact with it. The system remembers your preferences, dynamically adjusts the filters, and provides a clean, clutter-free interface that makes navigation simple and quick. By focusing on personalization, it transforms what’s often a frustrating process into something smoother and more intuitive.",
            "flow": "/project/flightapp/flight-app-feature.png",
            "conclusion": "This project was a personal learning journey, where I had the freedom to explore every layer—from user research to prototyping. The biggest takeaway was that effective design isn’t just about delivering a clean interface. It’s about empathy: understanding how users think, and crafting an experience that helps them make decisions with ease. Through this process, I was able to design a system that feels both intuitive and intelligent, responding to the traveler’s needs in real-time.",
            "shot": "/project/flightapp/flight-app-shot.png"
        },
        {
            "category": "App",
            "id": 2,
            "title": "Keywi Music App",
            "subtitle": "Discovering Music Together",
            "type": "Case Study",
            "img": "/project/keywi/keywi-img.png",
            "main": "/project/keywi/keywi-img.png",
            "desc": "As a music lover, I’ve spent countless hours exploring new tracks and sharing discoveries with friends. The process can be exciting—but finding music that resonates with my tastes, and that of my friends, often feels like a guessing game. Inspired by this frustration, I set out to design a music discovery app that feels more like a conversation: *sharing, discovering, and experiencing music together.*",
            "skill": "UX/UI",
            "isFeatured": false,
            "isLatest": true,
            "month": "04",
            "year": "2024",
            "tag": "Discover",
            "demo": "https://www.figma.com/proto/mXRDv1Scb8THEIzC9XNZbj/AVZ_ProjectKeywi_app?page-id=3102%3A60&type=design&node-id=3163-2472&viewport=607%2C382%2C0.18&t=bbRK2fOt9HVWTbxQ-1&scaling=scale-down&starting-point-node-id=3163%3A2472&content-scaling=fixed",
            "overview": "Overview content goes here...",
            "dropdowns": [
                {
                    "title": "Voices of Music Lovers",
                    "image": "/project/keywi/keywi-main.png",
                    "text": "Before jumping into the design process, I wanted to hear from real users. I studied how people talk about discovering music on platforms like Spotify, Apple Music, and more niche communities. The key takeaway? Music discovery is too often a solitary, fragmented experience. There’s no easy way to sync up with friends and share tracks in real-time. Users were craving a platform that made music discovery more social and personalized."
                },
                {
                    "title": "Personas that Share the Beat",
                    "image": "/project/keywi/keywi-persona.png",
                    "text": "From these insights, I created three primary personas: the **Casual Explorer**, the **Genre Enthusiast**, and the **Social Sharer**. These personas reflect the variety of ways people engage with music—whether it’s stumbling upon new genres, following specific artist journeys, or sharing their latest find with friends. By designing around their unique behaviors, the app could adapt to their needs while encouraging social interaction."
                },
                {
                    "title": "Building the Framework for Discovery",
                    "image": "/project/keywi/keywi-process.png",
                    "text": "With personas in mind, I developed a **dynamic, modular system** that adapts to user preferences. The goal was to create an app that doesn’t just recommend music—it evolves based on individual listening habits. I worked through multiple iterations in Figma, making sure every feature—from genre-based playlists to collaborative sessions—was tested for usability and social engagement."
                },
                {
                    "title": "Features That Bring Music to Life",
                    "image": "/project/keywi/keywi-flow.png",
                    "text": "The final product incorporates features that make music discovery fun and social. Key functionalities include: real-time playlist sharing with friends, genre-based music explorations, and personalized suggestions based on listening behavior. The app also encourages collaboration by enabling users to contribute to shared playlists, making discovering new music feel like a team effort."
                }
            ],
            "text": "Key features of Keywi revolve around enhancing the social experience of music discovery. The interface encourages users to explore genres, share recommendations, and collaborate on playlists—all while receiving personalized suggestions based on listening habits. The goal was to create an app that feels natural to interact with, like chatting with friends about the latest track or artist they’ve discovered.",
            "flow": "/project/keywi/keywi-feature.png",
            "conclusion": "This project was a celebration of my love for music and the communities that form around it. It taught me the importance of building not just for the individual user, but for those moments of social interaction that make discovering new tracks exciting. I also learned how personalization can be seamlessly woven into a social experience to enhance user engagement. Through this project, I realized that great design doesn’t just meet the needs of a user—it amplifies their passions and connects them with others who share the same love for discovery.",
            "shot": "/project/keywi/keywi-shot.png"
        },
        {
            "category": "Branding",
            "id": 5,
            "title": "Madam Do",
            "subtitle": "Bahn Mi to go",
            "type": "Branding",
            "img": "/project/madamdo/madamdo-img.png",
            "main": "/project/madamdo/madamdo-img.png",
            "desc": "focused on bringing authentic Vietnamese street food to Germany. The branding combines traditional Vietnamese aesthetics with modern design elements to appeal to a diverse audience.",
            "skill": "Branding",
            "isFeatured": true,
            "month": "02",
            "year": "2021",
            "tag": "Brand Book",
            "pdfUrl": "/files/madamdobrand.pdf",
            "text": "The branding draws inspiration from fresh Vietnamese ingredients, capturing the vibrant colors and textures that define the cuisine. A carefully selected color palette emphasizes freshness, while the Saigon font is used to highlight the brand's authentic origins, evoking the rich culture and flavors of Vietnam.",
            "flow": "/project/madamdo/madamdo-feature.png",
            "conclusion": "This project emphasized capturing the essence of Vietnamese cuisine and transforming it into a modern yet authentic brand identity. By blending traditional elements with contemporary design, the branding highlights the rich culinary heritage while appealing to a diverse audience. The iterative process showcased the value of refining design choices based on visual feedback, leading to a vibrant and inviting brand that celebrates authenticity, freshness, and the unique flavors of Vietnamese street food.",
            "shot": "/project/madamdo/kmadam-do-shot.png"
        },
        {
            "category": "Branding",
            "id": 6,
            "title": "Philip Kehela",
            "subtitle": "E-commerce Consultant",
            "type": "Branding",
            "img": "/project/pke/pke-img.png",
            "main": "/project/pke/pke-img.png",
            "desc": "Philip Kehela is a digital commerce consultant who wanted to strengthen his online presence with a cohesive and modern personal brand. The project focused on creating a digital identity that conveys his expertise in the field of e-commerce, while ensuring a sleek and functional design for his website.",
            "skill": "Web Development",
            "isFeatured": true,
            "month": "06",
            "year": "2024",
            "tag": "Consult",
            "pdfUrl": "/files/pkebrand.pdf",
            "text": " This project involved building a strong personal brand for Philip Kehela, a digital commerce consultant, by designing and launching a refreshed digital presence. We developed a new website using Elementor, which brought his ideas to life through clean and intuitive design. Careful attention was given to selecting logos, fonts, and layout to ensure they communicated his approach to digital commerce effectively. The relaunch resulted in a visually appealing, user-friendly site that supports Philip's work in the industry.",
            "flow": "/project/pke/pke-feature.png",
            "conclusion": "In conclusion, this project successfully established a modern digital identity for Philip Kehela, enhancing his online presence as a digital commerce consultant. By designing a sleek, user-friendly website with Elementor, we translated his expertise into a visually appealing platform. The careful selection of logos, fonts, and layout effectively communicated his approach to digital commerce. This revitalized presence positions Philip for continued growth and engagement within the e-commerce landscape.",
            "shot": "/project/pke/pke-shot.png"
        }
    ]
}